Paws_and_Tails/app/controllers/animals_controller.rb

SELECT "animals".* FROM "animals" ORDER BY "animals"."name" ASC
---
  def index
    @animals = Animal.all.order(:name)

INSERT INTO "animals" ("name", "animal_type", "breed", "price", "anticipated_birthday", "breeder_id", "created_at", "updated_at", "image_link") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @animal = Animal.new(animal_params)

    if @animal.save

UPDATE "animals" SET "name" = ?, "price" = ?, "updated_at" = ? WHERE "animals"."id" = ?  [["name", "Hans"], ["price", 550.0], ["updated_at", "2022-11-13 21:46:14.449290"], ["id", 1]]
---
  def update
    if @animal.update(animal_params)

DELETE FROM "animals" WHERE "animals"."id" = ?  [["id", 1]]
---
  def destroy
    @animal.destroy

SELECT "animals".* FROM "animals" ORDER BY "animals"."name" ASC
SELECT "animals".* FROM "animals" ORDER BY anticipated_birthday
SELECT "animals".* FROM "animals" INNER JOIN "breeders" ON "breeders"."id" = "animals"."breeder_id" WHERE "breeders"."city" = ? AND "breeders"."country" = ? ORDER BY "animals"."name" ASC  [["city", "Montreal"], ["country", "Canada"]]
SELECT "animals".* FROM "animals" INNER JOIN "breeders" ON "breeders"."id" = "animals"."breeder_id" WHERE "breeders"."country" = $1 ORDER BY "animals"."name" ASC  [["country", "United States"]]
---
  def sort_location
    city = params[:city] == "Any City" ? nil : params[:city]
    country = params[:country] == "Any Country" ? nil : params[:country]
    sorting_method = params[:sorting]

    animals = Animal.location_refine city, country

    if sorting_method == "Any" || sorting_method == "name"
      animals = animals.order(:name)
    elsif sorting_method != "city" && sorting_method != "country"
      animals = animals.order(sorting_method)
    else
      animals = animals.includes(:breeder).order("breeders.#{sorting_method}")
    end

    breeders = Array.new

    animals.each do |each_animal|