Paws_and_Tails/app/controllers/breeders_controller.rb

  def index
    @breeders = Breeder.all
---
SELECT "breeders".* FROM "breeders"

  def create
    @breeder = Breeder.new(breeder_params)

    if @breeder.save
---
INSERT INTO "breeders" ("name", "city", "country", "price_level", "address", "created_at", "updated_at", "email") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @breeder.update(breeder_params)
---
UPDATE "breeders" SET "name" = ?, "country" = ?, "updated_at" = ? WHERE "breeders"."id" = ?  [["name", "Good Morning"], ["country", "UK"], ["updated_at", "2022-11-17 02:38:35.372670"], ["id", 1]]

  def destroy
    @breeder.destroy
---
DELETE FROM "breeders" WHERE "breeders"."id" = ?  [["id", 1]]

  def set_breeder
    @breeder = Breeder.find(params[:id])
---
SELECT "breeders".* FROM "breeders" WHERE "breeders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]