Paws_and_Tails/app/models/animal.rb

  def self.get_breeder(animal_id)
    animal = Animal.find(animal_id)
    breeder = Breeder.find(animal.breeder_id)
---
SELECT "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]
SELECT "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]
SELECT "breeders".* FROM "breeders" WHERE "breeders"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]