Paws_and_Tails/app/models/breeder.rb

  def self.get_city_all
    Breeder.distinct.pluck(:city)
---
SELECT DISTINCT "breeders"."city" FROM "breeders"

  def self.get_country_all
    Breeder.distinct.pluck(:country)
---
SELECT DISTINCT "breeders"."country" FROM "breeders"