Paws_and_Tails/app/views/breeders/show.html.erb

SELECT "animals".* FROM "animals" WHERE "animals"."breeder_id" = $1  [["breeder_id", 1]]
---
                <br>
                <strong>Location:</strong> <%= Animal.get_breeder(animal.id).city%>, <%= Animal.get_breeder(animal.id).country%>